base/InformationRegisters/бит_НастройкиВыбораИОграниченияЗначенийПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиВыбораИОграниченияЗначенийПараметров</Name>
			<Comment>ЛТ6.2</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаборОграничений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НаборыОграниченийИХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АктивностьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитХарактеристики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_НастройкиВыбораИОграниченияЗначенийПараметров/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура РеквизитХарактеристикиПриИзменении(Элемент)
	
	Перем мПараметрыВыбора, Параметр;
	
	мПараметрыВыбора = Новый Массив();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Запись.РеквизитХарактеристики) Тогда
		Параметр = Новый ПараметрВыбора("Отбор.РеквизитХарактеристики", ЭтаФорма.Запись.РеквизитХарактеристики);
		мПараметрыВыбора.Добавить(Параметр);
	КонецЕсли;
	
	ЭтаФорма.Элементы.НаборОграничений.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Запись.ИДЗаписи) Тогда
		Запись.ИДЗаписи = ПолучитьИДЗаписи();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция	ПолучитьИДЗаписи()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_НастройкиВыбораИОграниченияЗначенийПараметров.ИДЗаписи КАК ИДЗаписи
		|ИЗ
		|	РегистрСведений.бит_НастройкиВыбораИОграниченияЗначенийПараметров КАК бит_НастройкиВыбораИОграниченияЗначенийПараметров
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИДЗаписи УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИДЗаписи + 1;
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции
